{
  "auto_mapping": null,
  "base_model_name_or_path": "bigscience/bloomz-560m",
  "inference_mode": true,
  "num_attention_heads": 16,
  "num_layers": 24,
  "num_ranks": 1,
  "num_transformer_submodules": 1,
  "num_views": 4,
  "num_virtual_tokens": 20,
  "peft_type": "COREG_PROMPT_TUNING",
  "prompt_tuning_init": "RANDOM",
  "prompt_tuning_init_state_dict_path": null,
  "prompt_tuning_init_task": 0,
  "revision": null,
  "task_type": "CAUSAL_LM",
  "token_dim": 1024
}